tap "homebrew/bundle"
brew "bat"
brew "binutils"
brew "btop"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "lazygit"
brew "python@3.13"
brew "llvm"
brew "lolcat"
brew "openjdk"
brew "maven"
brew "micro"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "nsnake"
brew "pandoc"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "powerlevel10k"
brew "pre-commit"
brew "pv"
brew "pyenv"
brew "pygments"
brew "pyinstaller"
brew "python-lsp-server"
brew "python-matplotlib"
brew "python-tk@3.13"
brew "ripgrep"
brew "ripgrep-all"
brew "riscv64-elf-gcc"
brew "rsync"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "s-search"
brew "stow"
brew "telnet"
brew "terminal-notifier"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "whisperkit-cli"
brew "wtf"
brew "xclip"
brew "xcodegen"
brew "zig"
brew "zinit"
cask "alcove"
cask "alt-tab"
cask "anaconda"
cask "apparency"
cask "betterdisplay"
cask "caffeine"
cask "discord"
cask "docker-desktop"
cask "ghidra"
cask "ghostty"
cask "karabiner-elements"
cask "neovide-app"
cask "obsidian"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "raycast"
cask "rectangle-pro"
cask "suspicious-package"
cask "typora"
cask "visual-studio-code"
cask "zen"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zhwu95.riscv"
