tap "barutsrb/tap"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "homebrew-zathura/zathura"
tap "homebrew/bundle"
tap "jackielii/tap"
tap "karinushka/paneru"
tap "neur0map/tap"
tap "nikitabobko/tap"
tap "philocalyst/tap"
tap "protonpass/tap"
tap "sass/sass"
tap "scarvalhojr/tap"
brew "python@3.14"
brew "aerc"
brew "aircrack-ng"
brew "bat"
brew "binutils"
brew "p7zip"
brew "binwalk"
brew "btop"
brew "carapace"
brew "catimg"
brew "coreutils"
brew "curl"
brew "dust"
brew "exif"
brew "eza"
brew "fastfetch"
brew "fd"
brew "figlet"
brew "fzf"
brew "gcc"
brew "ghidra"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "hashcat"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "isync"
brew "jc"
brew "john-jumbo"
brew "jq"
brew "just"
brew "lazygit"
brew "lf"
brew "libfido2"
brew "libxcrypt"
brew "llvm"
brew "lolcat"
brew "mosml"
brew "mpv"
brew "neovim"
brew "nmap"
brew "node"
brew "noseyparker"
brew "nushell"
brew "ripgrep"
brew "opencode"
brew "openjdk"
brew "openssh"
brew "ophcrack"
brew "pandoc"
brew "pick"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "pre-commit"
brew "prettier"
brew "pv"
brew "pygments"
brew "python-lsp-server"
brew "python@3.13"
brew "rsync"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "shellcheck"
brew "starship"
brew "stow"
brew "stylua"
brew "taplo"
brew "telnet"
brew "tmux"
brew "topgrade"
brew "transmission-cli", restart_service: :changed
brew "tree"
brew "tree-sitter-cli"
brew "trufflehog"
brew "tty-clock"
brew "uv"
brew "vim"
brew "w3m"
brew "wget"
brew "whois"
brew "wireshark"
brew "xclip"
brew "ykman"
brew "yubico-piv-tool"
brew "zinit"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "neur0map/tap/gpk"
brew "philocalyst/tap/caligula"
brew "protonpass/tap/pass-cli"
brew "sass/sass/sass"
cask "nikitabobko/tap/aerospace"
cask "alcove"
cask "apparency"
cask "betterdisplay"
cask "caffeine"
cask "discord"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "font-sketchybar-app-font"
cask "font-space-mono-nerd-font"
cask "ghostty"
cask "helium-browser"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "obsidian"
cask "proton-mail"
cask "proton-mail-bridge"
cask "proton-pass"
cask "protonvpn"
cask "raspberry-pi-imager"
cask "raycast"
cask "stremio"
cask "vlc"
cask "wireshark-app"
cask "xquartz"
cask "yubico-authenticator"
cask "zen"
cargo "cargo-update"
cargo "ghgrab"
cargo "metapac"
cargo "nu-lint"
cargo "nufmt"
cargo "rusty-hook"
cargo "tdf-viewer"
