tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "philocalyst/tap"
tap "scarvalhojr/tap"
brew "sqlite"
brew "aircrack-ng"
brew "bat"
brew "binutils"
brew "p7zip"
brew "binwalk"
brew "btop"
brew "cmake"
brew "coreutils"
brew "curl"
brew "docker"
brew "dust"
brew "exif"
brew "eza"
brew "figlet"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghidra"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "hashcat"
brew "hyperfine"
brew "john-jumbo"
brew "lazygit"
brew "libxcrypt"
brew "python@3.14"
brew "llvm"
brew "lolcat"
brew "mosml"
brew "mpv"
brew "neovim"
brew "neovide"
brew "python@3.13"
brew "nmap"
brew "node"
brew "noseyparker"
brew "opencode"
brew "openjdk"
brew "ophcrack"
brew "pandoc"
brew "pipx"
brew "pre-commit"
brew "pv"
brew "pygments"
brew "python-lsp-server"
brew "r"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "starship"
brew "stow"
brew "telnet"
brew "tmux"
brew "transmission-cli", restart_service: :changed
brew "tree"
brew "utftex"
brew "uv"
brew "vim"
brew "weasyprint"
brew "wget"
brew "wireshark"
brew "xclip"
brew "yazi"
brew "zinit"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "philocalyst/tap/caligula"
cask "aerospace"
cask "apparency"
cask "betterdisplay"
cask "claude-code"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "ghidra"
cask "ghostty"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "ollama-app"
cask "quarto"
cask "raspberry-pi-imager"
cask "raycast"
cask "stremio"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "wireshark-app"
cask "zen"
