tap "barutsrb/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "philocalyst/tap"
tap "scarvalhojr/tap"
brew "aircrack-ng"
brew "bat"
brew "binutils"
brew "p7zip"
brew "binwalk"
brew "btop"
brew "carapace"
brew "coreutils"
brew "curl"
brew "docker"
brew "dust"
brew "exif"
brew "eza"
brew "fastfetch"
brew "fd"
brew "figlet"
brew "fzf"
brew "gcc"
brew "ghidra"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "python@3.14"
brew "grc"
brew "hashcat"
brew "hyperfine"
brew "imagemagick"
brew "jc"
brew "john-jumbo"
brew "lazygit"
brew "libfido2"
brew "libxcrypt"
brew "llvm"
brew "lolcat"
brew "md2pdf"
brew "mosml"
brew "mpv"
brew "neovim"
brew "python@3.13"
brew "nmap"
brew "node"
brew "noseyparker"
brew "nushell"
brew "ripgrep"
brew "opencode"
brew "openjdk"
brew "openssh"
brew "ophcrack"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "pre-commit"
brew "pv"
brew "pygments"
brew "python-lsp-server"
brew "rsync"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "starship"
brew "stow"
brew "telnet"
brew "tldr"
brew "tmux"
brew "transmission-cli", restart_service: :changed
brew "tree"
brew "trufflehog"
brew "tty-clock"
brew "utftex"
brew "uv"
brew "vim"
brew "wget"
brew "wireshark"
brew "xclip"
brew "ykman"
brew "yubico-piv-tool"
brew "zinit"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "philocalyst/tap/caligula"
cask "nikitabobko/tap/aerospace"
cask "alcove"
cask "apparency"
cask "betterdisplay"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "font-sketchybar-app-font"
cask "font-space-mono-nerd-font"
cask "ghostty"
cask "helium-browser"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "barutsrb/tap/omniwm"
cask "raspberry-pi-imager"
cask "raycast"
cask "stremio"
cask "typora"
cask "vlc"
cask "wireshark-app"
cask "xquartz"
cask "yubico-authenticator"
cargo "nu-lint"
