tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "scarvalhojr/tap"
brew "bat"
brew "binutils"
brew "btop"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "lazygit"
brew "python@3.13"
brew "llvm"
brew "lolcat"
brew "openjdk"
brew "maven"
brew "mpv"
brew "neofetch"
brew "neovim"
brew "node"
brew "pandoc"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "powerlevel10k"
brew "pre-commit"
brew "pv"
brew "pyenv"
brew "pygments"
brew "pyinstaller"
brew "python-lsp-server"
brew "python-matplotlib"
brew "python-tk@3.13"
brew "ripgrep"
brew "ripgrep-all"
brew "riscv64-elf-gcc"
brew "rsync"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "stow"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "wtf"
brew "xclip"
brew "xcodegen"
brew "zinit"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "scarvalhojr/tap/aoc-cli"
cask "aerospace"
cask "alcove"
cask "alt-tab"
cask "anaconda"
cask "apparency"
cask "betterdisplay"
cask "caffeine"
cask "discord"
cask "docker-desktop"
cask "ghidra"
cask "ghostty"
cask "karabiner-elements"
cask "neovide-app"
cask "ollama-app"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "raycast"
cask "suspicious-package"
cask "typora"
cask "visual-studio-code"
cask "zen"
